### 1. How to import pandas and check the version?

In [1]:
import pandas as pd
import numpy as np

In [2]:
pd.__version__

'0.23.4'

In [3]:
print(pd.show_versions(as_json=True))

{'system': {'commit': None, 'python': '3.7.1.final.0', 'python-bits': 64, 'OS': 'Windows', 'OS-release': '10', 'machine': 'AMD64', 'processor': 'Intel64 Family 6 Model 60 Stepping 3, GenuineIntel', 'byteorder': 'little', 'LC_ALL': 'None', 'LANG': 'None', 'LOCALE': 'None.None'}, 'dependencies': {'pandas': '0.23.4', 'pytest': '4.0.2', 'pip': '18.1', 'setuptools': '40.6.3', 'Cython': '0.29.2', 'numpy': '1.15.4', 'scipy': '1.1.0', 'pyarrow': None, 'xarray': None, 'IPython': '7.2.0', 'sphinx': '1.8.2', 'patsy': '0.5.1', 'dateutil': '2.7.5', 'pytz': '2018.7', 'blosc': None, 'bottleneck': '1.2.1', 'tables': '3.4.4', 'numexpr': '2.6.8', 'feather': None, 'matplotlib': '3.0.2', 'openpyxl': '2.5.12', 'xlrd': '1.2.0', 'xlwt': '1.3.0', 'xlsxwriter': '1.1.2', 'lxml': '4.2.5', 'bs4': '4.6.3', 'html5lib': '1.0.1', 'sqlalchemy': '1.2.15', 'pymysql': None, 'psycopg2': None, 'jinja2': '2.10', 's3fs': None, 'fastparquet': None, 'pandas_gbq': None, 'pandas_datareader': None}}
None

### 2. How to create a series from a list, numpy array and dict?

In [4]:
list1=[1,2,3,4,5,6,7,8,9,10]
np_array=np.arange(1,10)
dict1={'A':11,'B':12,'C':13,'D':14,'E':15,'F':16,'G':17,'H':18,'I':19,'J':20}

In [5]:
series_list=pd.Series(list1)
series_list

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [6]:
series_array=pd.Series(np_array)
series_array

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int32

In [7]:
series_dict=pd.Series(dict1)
series_dict

A    11
B    12
C    13
D    14
E    15
F    16
G    17
H    18
I    19
J    20
dtype: int64

### 3. How to convert the index of a series into a column of a dataframe?

In [8]:
series=pd.Series((11,12,13,14,15,16,17,18,19,20))

In [9]:
df=pd.DataFrame(series)
df.head()

    0
0  11
1  12
2  13
3  14
4  15

In [10]:
df.columns

RangeIndex(start=0, stop=1, step=1)

In [11]:
df1=df.reset_index()
df1.head()

   index   0
0      0  11
1      1  12
2      2  13
3      3  14
4      4  15

In [12]:
df.columns

RangeIndex(start=0, stop=1, step=1)

In [13]:
df1.columns

Index(['index', 0], dtype='object')

### 4. How to combine many series to form a dataframe?

In [14]:
ser1=pd.Series(np.arange(0,11))
ser2=pd.Series(np.arange(10,21))
ser3=pd.Series(np.arange(20,31))

In [15]:
dfs=pd.concat([ser1,ser2,ser3],axis=1, keys=['A', 'B','C'])         # using concat method
dfs.head()

   A   B   C
0  0  10  20
1  1  11  21
2  2  12  22
3  3  13  23
4  4  14  24

In [16]:
dfs2=pd.DataFrame({'A': ser1, 'B': ser2, 'C': ser3})     # using dataframe method
dfs2.head()

   A   B   C
0  0  10  20
1  1  11  21
2  2  12  22
3  3  13  23
4  4  14  24

### 5. How to assign name to the series’ index?

In [17]:
ser4=pd.Series(np.arange(30,40), index=['A','B','C','D','E','F','G','H','I','J'])
ser4

A    30
B    31
C    32
D    33
E    34
F    35
G    36
H    37
I    38
J    39
dtype: int32

In [18]:
ser4.rename('ALPHA')            # to rename this series    or, ser4.name='Alpha'

A    30
B    31
C    32
D    33
E    34
F    35
G    36
H    37
I    38
J    39
Name: ALPHA, dtype: int32

### 6. How to get the items of series A which is not present in series B?

In [19]:
serA = pd.Series([1, 2, 3, 4, 5])
serB = pd.Series([4, 5, 6, 7, 8])

In [20]:
serA[~serA.isin(serB)]

0    1
1    2
2    3
dtype: int64

### 7. How to get the items not common to both series A and series B?

In [21]:
ser_u = pd.Series(np.union1d(serA, serB))
ser_u

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
dtype: int64

In [22]:
ser_i = pd.Series(np.intersect1d(serA, serB))
ser_i

0    4
1    5
dtype: int64

In [23]:
ser_u[~ser_u.isin(ser_i)]

0    1
1    2
2    3
5    6
6    7
7    8
dtype: int64

#### 2nd method

In [24]:
a_not_b=serA[~serA.isin(serB)]
a_not_b

0    1
1    2
2    3
dtype: int64

In [25]:
b_not_a=serB[~serB.isin(serA)]
b_not_a

2    6
3    7
4    8
dtype: int64

In [26]:
a_not_b.append(b_not_a)

0    1
1    2
2    3
2    6
3    7
4    8
dtype: int64

### 8. How to get the minimum, 25th percentile, median, 75th, and max of a numeric series?

##### input
##### state = np.random.RandomState(100)
##### ser = pd.Series(state.normal(10, 5, 25))  

##### (doubt, need to ask)

In [27]:
serA.describe()

count    5.000000
mean     3.000000
std      1.581139
min      1.000000
25%      2.000000
50%      3.000000
75%      4.000000
max      5.000000
dtype: float64

### 9. How to get frequency counts of unique items of a series?

In [28]:
ser = pd.Series(np.take(a=list('abcdefgh'), indices=np.random.randint(8, size=100)))
ser.value_counts()

d    14
b    14
f    14
a    14
c    13
e    13
h    11
g     7
dtype: int64

### 10. How to keep only top 2 most frequent values as it is and replace everything else as ‘Other’?

In [29]:
np.random.RandomState(100)
ser = pd.Series(np.random.randint(1, 5, [12]))

In [30]:
ser.value_counts()
ser[~ser.isin(ser.value_counts().index[:2])] = 'Other'
ser

0     Other
1         4
2         1
3     Other
4         1
5         4
6         4
7         1
8     Other
9     Other
10        4
11        4
dtype: object

### 11. How to bin a numeric series to 10 groups of equal size?

In [31]:
ser = pd.Series(np.random.random(20))

### 12. How to convert a numpy array to a dataframe of given shape? (L1)
##### Reshape the series ser into a dataframe with 7 rows and 5 columns

In [32]:
ser = pd.Series(np.random.randint(1, 10, 35))

In [33]:
df=pd.DataFrame(np.array(ser).reshape(7,5), columns=['A','B','C','D','E'], index=['a','b','c','d','e','f','g'])
df

   A  B  C  D  E
a  3  6  2  4  8
b  9  4  1  2  2
c  9  4  6  7  5
d  6  8  8  3  8
e  2  9  8  3  3
f  6  5  6  5  7
g  7  2  8  9  3

In [34]:
df1=pd.DataFrame(ser.values.reshape(7, 5))
df1

   0  1  2  3  4
0  3  6  2  4  8
1  9  4  1  2  2
2  9  4  6  7  5
3  6  8  8  3  8
4  2  9  8  3  3
5  6  5  6  5  7
6  7  2  8  9  3

### 13. How to find the positions of numbers that are multiples of 3 from a series?

##### Find the positions of numbers that are multiples of 3 from ser.

In [35]:
ser = pd.Series(np.random.randint(1, 5, 10))
a=ser.values
a

array([1, 3, 3, 2, 1, 2, 4, 2, 2, 4])

In [36]:
type(a)

numpy.ndarray

In [37]:
type(ser)

pandas.core.series.Series

In [38]:
ser[ser%3==0]                       # 1st method

1    3
2    3
dtype: int32

In [39]:
# using the where clause
ser.where(lambda x: x%3 == 0).dropna()

# using numpy and reshape to get a pandas series
#pd.Series(np.argwhere(ser%3 == 0).reshape(4))
np.argwhere(ser%3 == 0)

array([[1],
       [2]], dtype=int64)

In [40]:
ser.where(lambda x: x%3 == 0).dropna()                 # 2nd method

1    3.0
2    3.0
dtype: float64

In [41]:
np.argwhere(ser%3 == 0)               #  3rd method

array([[1],
       [2]], dtype=int64)

### 14. How to extract items at given positions from a series
##### From ser, extract the items at positions in list pos.

In [42]:
ser = pd.Series(list('abcdefghijklmnopqrstuvwxyz'))
pos = [0, 4, 8, 14, 20]

In [43]:
a1=ser.values
a1

array(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm',
       'n', 'o', 'p', 'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z'],
      dtype=object)

In [44]:
ser.iloc[[0,4,8,14,20]]            # or, ser.loc[pos]

0     a
4     e
8     i
14    o
20    u
dtype: object

### 15. How to stack two series vertically and horizontally ?
#### Stack ser1 and ser2 vertically and horizontally (to form a dataframe).

In [45]:
ser1 = pd.Series(range(5))
ser2 = pd.Series(list('abcde'))

In [46]:
df=pd.DataFrame(np.stack((ser1,ser2), axis=1))
df

   0  1
0  0  a
1  1  b
2  2  c
3  3  d
4  4  e

In [47]:
df1=pd.DataFrame(np.stack((ser1,ser2)))
df1

   0  1  2  3  4
0  0  1  2  3  4
1  a  b  c  d  e

### 16. How to get the positions of items of series A in another series B?

#### Get the positions of items of ser2 in ser1 as a list.

In [264]:
## problem

ser1 = pd.Series([10, 9, 6, 5, 3, 1, 12, 8, 13])
ser2 = pd.Series([1, 3, 10, 13])

### 17. How to compute the mean squared error on a truth and predicted series?

#### Compute the mean squared error of truth and pred series.

In [49]:
truth = pd.Series(range(10))
pred = pd.Series(range(10)) + np.random.random(10)

In [50]:
error=truth-pred

In [51]:
mean_sqr_error=np.mean(error**2)
mean_sqr_error

0.2236926636148274

### 18. How to convert the first character of each element in a series to uppercase?

#### Change the first character of each word to upper case in each word of ser.

In [52]:
ser = pd.Series(['just', 'a', 'random', 'list'])

In [53]:
for i in ser:
    print(i.title())

Just
A
Random
List

### 19. How to calculate the number of characters in each word in a series?

In [54]:
ser = pd.Series(['just', 'a', 'random', 'list'])

In [55]:
for i in ser:                                # ist method
    print(len(i))

4
1
6
4

In [56]:
ser.map(len)                         # 2nd method

0    4
1    1
2    6
3    4
dtype: int64

In [57]:
ser.apply(len)

0    4
1    1
2    6
3    4
dtype: int64

### 20. How to compute difference of differences between consequtive numbers of a series?

#### Difference of differences between the consequtive numbers of ser.

In [58]:
ser = pd.Series([1, 3, 6, 10, 15, 21, 27, 35])

In [59]:
ser.diff()

0    NaN
1    2.0
2    3.0
3    4.0
4    5.0
5    6.0
6    6.0
7    8.0
dtype: float64

In [60]:
ser.diff().tolist()

[nan, 2.0, 3.0, 4.0, 5.0, 6.0, 6.0, 8.0]

In [61]:
ser.diff(periods=2).tolist()

[nan, nan, 5.0, 7.0, 9.0, 11.0, 12.0, 14.0]

### 21. How to convert a series of date-strings to a timeseries?

In [62]:
ser = pd.Series(['01 Jan 2010', '02-02-2011', '20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20'])

In [63]:
ser

0         01 Jan 2010
1          02-02-2011
2            20120303
3          2013/04/04
4          2014-05-05
5    2015-06-06T12:20
dtype: object

In [64]:
pd.to_datetime(ser)

0   2010-01-01 00:00:00
1   2011-02-02 00:00:00
2   2012-03-03 00:00:00
3   2013-04-04 00:00:00
4   2014-05-05 00:00:00
5   2015-06-06 12:20:00
dtype: datetime64[ns]

### 22. How to get the day of month, week number, day of year and day of week from a series of date strings?

#### Get the day of month, week number, day of year and day of week from ser.

In [65]:
ser = pd.Series(['01 Jan 2010', '02-02-2011', '20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20'])

In [66]:
pd.to_datetime(ser)

0   2010-01-01 00:00:00
1   2011-02-02 00:00:00
2   2012-03-03 00:00:00
3   2013-04-04 00:00:00
4   2014-05-05 00:00:00
5   2015-06-06 12:20:00
dtype: datetime64[ns]

In [67]:
date=pd.to_datetime(ser).dt.day.tolist()
print('Day of the Month :', date)

Day of the Month : [1, 2, 3, 4, 5, 6]

In [68]:
week=pd.to_datetime(ser).dt.week.tolist()
print('Week number :', week)

Week number : [53, 5, 9, 14, 19, 23]

In [69]:
dn=pd.to_datetime(ser).dt.weekday_name.tolist()
print('Day Name :', dn)

Day Name : ['Friday', 'Wednesday', 'Saturday', 'Thursday', 'Monday', 'Saturday']

In [70]:
year=pd.to_datetime(ser).dt.year.tolist()
print('Year :', year)

Year : [2010, 2011, 2012, 2013, 2014, 2015]

In [71]:
doy=pd.to_datetime(ser).dt.dayofyear.tolist()
print('Day of Year :', year)

Day of Year : [2010, 2011, 2012, 2013, 2014, 2015]

### 23. How to convert year-month string to dates corresponding to the 4th day of the month?

#### Change ser to dates that start with 4th of the respective months.

In [72]:
ser = pd.Series(['Jan 2010', 'Feb 2011', 'Mar 2012'])

In [73]:
pd.to_datetime(ser)    # it should start from 4th, need to ask

0   2010-01-01
1   2011-02-01
2   2012-03-01
dtype: datetime64[ns]

### 24. How to filter words that contain atleast 2 vowels from a series?
#### From ser, extract words that contain atleast 2 vowels.

In [263]:
## problem

ser = pd.Series(['Apple', 'Orange', 'Plan', 'Python', 'Money'])

###  25. How to filter valid emails from a series?
#### Extract the valid emails from the series emails. The regex pattern for valid emails is provided as reference.

In [262]:
## problem

emails = pd.Series(['buying books at amazom.com', 'rameses@egypt.com', 'matt@t.co', 'narendra@modi.com'])
pattern ='[A-Za-z0-9._%+-]+@[A-Za-z0-9.-]+\\.[A-Za-z]{2,4}'

###  26. How to get the mean of a series grouped by another series?

#### Compute the mean of weights of each fruit.

In [80]:
fruit = pd.Series(np.random.choice(['apple', 'banana', 'carrot'], 10))
weights = pd.Series(np.linspace(1, 10, 10))

In [82]:
weights.groupby(fruit).mean()

apple     4.333333
banana    6.833333
carrot    1.000000
dtype: float64

In [88]:
df=pd.concat([fruit,weights], axis=1)
df

        0     1
0  carrot   1.0
1   apple   2.0
2  banana   3.0
3  banana   4.0
4   apple   5.0
5   apple   6.0
6  banana   7.0
7  banana   8.0
8  banana   9.0
9  banana  10.0

In [91]:
df.groupby(fruit).mean()

               1
apple   4.333333
banana  6.833333
carrot  1.000000

###  27. How to compute the euclidean distance between two series?
#### Compute the euclidean distance between series (points) p and q, without using a packaged formula.


The Euclidean distance between points p and q is the length of the line segment connecting them.

In Cartesian coordinates, if p = (p1, p2,..., pn) and q = (q1, q2,..., qn) are two points in Euclidean n-space, then the Euclidean distance (d) from p to q, or from q to p, is given by the Pythagorean formula:

 \begin{aligned}d(\mathbf {p} ,\mathbf {q} )=d(\mathbf {q} ,\mathbf {p} )&={\sqrt {(q_{1}-p_{1})^{2}+(q_{2}-p_{2})^{2}+\cdots +(q_{n}-p_{n})^{2}}}\\[8pt]&={\sqrt {\sum _{i=1}^{n}(q_{i}-p_{i})^{2}}}.\end{aligned}}} \begin{aligned}d(\mathbf {p} ,\mathbf {q} )=d(\mathbf {q} ,\mathbf {p} )&={\sqrt {(q_{1}-p_{1})^{2}+(q_{2}-p_{2})^{2}+\cdots +(q_{n}-p_{n})^{2}}}\\[8pt]&={\sqrt {\sum _{i=1}^{n}(q_{i}-p_{i})^{2}}}.\end{aligned}}}

In [92]:
p = pd.Series([1, 2, 3, 4, 5, 6, 7, 8, 9, 10])
q = pd.Series([10, 9, 8, 7, 6, 5, 4, 3, 2, 1])

In [100]:
ad=((p-q)**2)
ad

0    81
1    49
2    25
3     9
4     1
5     1
6     9
7    25
8    49
9    81
dtype: int64

In [110]:
np.sqrt(ad.sum())

18.16590212458495

###  28. How to find all the local maxima (or peaks) in a numeric series?

In [261]:
## problem

ser = pd.Series([2, 10, 3, 4, 9, 10, 2, 7, 3])

### 29. How to replace missing spaces in a string with the least frequent character?

#### Replace the spaces in my_str with the least frequent character.

In [260]:
## problem

my_str = 'dbc deb abed ggade'

###  30. How to create a TimeSeries starting ‘2000-01-01’ and 10 weekends (saturdays) after that having random numbers as values?

In [150]:
ts=pd.Series(pd.date_range('2000-01-01', periods=10, freq='w-sat'))
rndm=pd.Series(np.random.randint(1,10) for i in range(10))

df=pd.concat({'time':ts, 'number': rndm}, axis=1)
df

   number       time
0       9 2000-01-01
1       4 2000-01-08
2       7 2000-01-15
3       3 2000-01-22
4       2 2000-01-29
5       9 2000-02-05
6       4 2000-02-12
7       7 2000-02-19
8       8 2000-02-26
9       4 2000-03-04

### 31. How to fill an intermittent time series so all missing dates show up with values of previous non-missing date?
#### ser has missing dates and values. Make all missing dates appear and fill up with value from previous date.

In [163]:
ser = pd.Series([1,10,3,np.nan], index=pd.to_datetime(['2000-01-01', '2000-01-03', '2000-01-06', '2000-01-08']))

In [168]:
index=pd.date_range('2000-01-01', periods=8)    # assiging new index
new_ser=ser.reindex(index)
new_ser.fillna(method='ffill')

2000-01-01     1.0
2000-01-02     1.0
2000-01-03    10.0
2000-01-04    10.0
2000-01-05    10.0
2000-01-06     3.0
2000-01-07     3.0
2000-01-08     3.0
Freq: D, dtype: float64

In [172]:
ser.resample('D').ffill()    #  2nd method

2000-01-01     1.0
2000-01-02     1.0
2000-01-03    10.0
2000-01-04    10.0
2000-01-05    10.0
2000-01-06     3.0
2000-01-07     3.0
2000-01-08     NaN
Freq: D, dtype: float64

### 32. How to compute the autocorrelations of a numeric series?
#### Compute autocorrelations for the first 10 lags of ser. Find out which lag has the largest correlation.

In [173]:
ser = pd.Series(np.arange(20) + np.random.normal(1, 10, 20))

In [176]:
ser.autocorr(lag=10)

0.07929655700643394

### 33. How to import only every nth row from a csv file to create a dataframe?
#### Import every 50th row of BostonHousing dataset as a dataframe.

In [259]:
# problem
name = ['CRIM', 'ZN', 'INDUS', 'CHAS', 'NOX', 'RM', 'AGE', 'DIS', 'RAD', 'TAX', 'PTRATIO', 'B', 'LSTAT', 'MEDV']
df=pd.read_csv('D:\Practice Pandas\Data Analysis\housing.csv', header=None)
df.head()

                                                   0
0   0.00632  18.00   2.310  0  0.5380  6.5750  65...
1   0.02731   0.00   7.070  0  0.4690  6.4210  78...
2   0.02729   0.00   7.070  0  0.4690  7.1850  61...
3   0.03237   0.00   2.180  0  0.4580  6.9980  45...
4   0.06905   0.00   2.180  0  0.4580  7.1470  54...

### 34. How to change column values when importing csv to a dataframe?    
#### Import the boston housing dataset, but while importing change the 'medv' (median house value) column so that values < 25 becomes ‘Low’ and > 25 becomes ‘High’.

In [268]:
## problem
names = ['CRIM', 'ZN', 'INDUS', 'CHAS', 'NOX', 'RM', 'AGE', 'DIS', 'RAD', 'TAX', 'PTRATIO', 'B', 'LSTAT', 'MEDV']
with open('D:\Practice Pandas\Data Analysis\housing.csv') as f:
    data = f.read()
    nth_rows = []
    for i, rows in enumerate(data.split("\n")):
        nth_rows.append(rows)

data_ = [nth_rows[i].split() for i in range(len(nth_rows))]

df = pd.DataFrame(data_, columns=names)
df.head()
df.to_csv('D:\Practice Pandas\Data Analysis\housing_columns.csv')

### 35. How to create a dataframe with rows as strides from a given series?

L = pd.Series(range(15))

Desired Output

array([[ 0,  1,  2,  3],
       [ 2,  3,  4,  5],
       [ 4,  5,  6,  7],
       [ 6,  7,  8,  9],
       [ 8,  9, 10, 11],
       [10, 11, 12, 13]])

In [267]:
## problem

L = pd.Series(range(15))

### 36. How to import only specified columns from a csv file?

In [273]:
df1=pd.read_csv('D:\Practice Pandas\Data Analysis\housing_columns.csv', usecols=[1,2])

In [274]:
df1.head()

      CRIM    ZN
0  0.00632  18.0
1  0.02731   0.0
2  0.02729   0.0
3  0.03237   0.0
4  0.06905   0.0

### 37. How to get the nrows, ncolumns, datatype, summary stats of each column of a dataframe? Also get the array and list equivalent.

In [2]:
df=pd.read_csv('D:\Practice Pandas\Data Analysis\housing_columns.csv')

# nrows and ncolumns
df.shape

(507, 15)

In [280]:
# datatype
df.dtypes

Unnamed: 0      int64
CRIM          float64
ZN            float64
INDUS         float64
CHAS          float64
NOX           float64
RM            float64
AGE           float64
DIS           float64
RAD           float64
TAX           float64
PTRATIO       float64
B             float64
LSTAT         float64
MEDV          float64
dtype: object

In [281]:
# summary
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 507 entries, 0 to 506
Data columns (total 15 columns):
Unnamed: 0    507 non-null int64
CRIM          506 non-null float64
ZN            506 non-null float64
INDUS         506 non-null float64
CHAS          506 non-null float64
NOX           506 non-null float64
RM            506 non-null float64
AGE           506 non-null float64
DIS           506 non-null float64
RAD           506 non-null float64
TAX           506 non-null float64
PTRATIO       506 non-null float64
B             506 non-null float64
LSTAT         506 non-null float64
MEDV          506 non-null float64
dtypes: float64(14), int64(1)
memory usage: 59.5 KB

In [ ]:
# how many columns under each dtype
df.get_dtype_counts()
#df.dtypes.value_counts()

In [283]:
df.get_dtype_counts()

float64    14
int64       1
dtype: int64

In [284]:
df.dtypes.value_counts()

float64    14
int64       1
dtype: int64

In [285]:
df.describe()

,Unnamed: 0,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
count,507.00000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000
mean,253.00000,3.613524,11.363636,11.136779,0.069170,0.554695,6.284634,68.574901,3.795043,9.549407,408.237154,18.455534,356.674032,12.653063,22.532806
std,146.50256,8.601545,23.322453,6.860353,0.253994,0.115878,0.702617,28.148861,2.105710,8.707259,168.537116,2.164946,91.294864,7.141062,9.197104
min,0.00000,0.006320,0.000000,0.460000,0.000000,0.385000,3.561000,2.900000,1.129600,1.000000,187.000000,12.600000,0.320000,1.730000,5.000000
25%,126.50000,0.082045,0.000000,5.190000,0.000000,0.449000,5.885500,45.025000,2.100175,4.000000,279.000000,17.400000,375.377500,6.950000,17.025000
50%,253.00000,0.256510,0.000000,9.690000,0.000000,0.538000,6.208500,77.500000,3.207450,5.000000,330.000000,19.050000,391.440000,11.360000,21.200000
75%,379.50000,3.677082,12.500000,18.100000,0.000000,0.624000,6.623500,94.075000,5.188425,24.000000,666.000000,20.200000,396.225000,16.955000,25.000000
max,506.00000,88.976200,100.000000,27.740000,1.000000,0.871000,8.780000,100.000000,12.126500,24.000000,711.000000,22.000000,396.900000,37.970000,50.000000

### 38. How to extract the row and column number of a particular cell with given criterion?

In [18]:
df=pd.read_csv('D:\Practice Pandas\Data Analysis\housing_columns.csv', index_col=0, skipfooter=1)
df.head()

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support skipfooter; you can avoid this warning by specifying engine='python'.
  """Entry point for launching an IPython kernel.

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222.0,18.7,396.90,5.33,36.2

In [19]:
df.shape

(506, 14)

In [23]:
# get the maximum value

df['TAX'].max()

711.0

In [28]:
# find the column and cell which we got the maximum value(Tax)

df[df['TAX'].max()==df['TAX']]

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
488,0.15086,0.0,27.74,0,0.609,5.454,92.7,1.8209,4,711.0,20.1,395.09,18.06,15.2
489,0.18337,0.0,27.74,0,0.609,5.414,98.3,1.7554,4,711.0,20.1,344.05,23.97,7.0
490,0.20746,0.0,27.74,0,0.609,5.093,98.0,1.8226,4,711.0,20.1,318.43,29.68,8.1
491,0.10574,0.0,27.74,0,0.609,5.983,98.8,1.8681,4,711.0,20.1,390.11,18.07,13.6
492,0.11132,0.0,27.74,0,0.609,5.983,83.5,2.1099,4,711.0,20.1,396.90,13.35,20.1

###  39. How to rename a specific columns in a dataframe?

In [104]:
df_car=pd.read_csv('D:\Practice Pandas\Data Analysis\Cars93.csv',index_col=0)
df_car.head(3)

,Manufacturer,Model,Type,Min.Price,Price,Max.Price,MPG.city,MPG.highway,AirBags,DriveTrain,...,Passengers,Length,Wheelbase,Width,Turn.circle,Rear.seat.room,Luggage.room,Weight,Origin,Make
1,Acura,Integra,Small,12.9,15.9,18.8,25,31,None,Front,...,5,177,102,68,37,26.5,11.0,2705,non-USA,Acura Integra
2,Acura,Legend,Midsize,29.2,33.9,38.7,18,25,Driver & Passenger,Front,...,5,195,115,71,38,30.0,15.0,3560,non-USA,Acura Legend
3,Audi,90,Compact,25.9,29.1,32.3,20,26,Driver only,Front,...,5,180,102,67,37,28.0,14.0,3375,non-USA,Audi 90

In [83]:
df_car.rename(columns={'Min.Price': 'Min_Price', 'Max.Price': 'Max_price'}).head(3)

,Manufacturer,Model,Type,Min_Price,Price,Max_price,MPG.city,MPG.highway,AirBags,DriveTrain,...,Passengers,Length,Wheelbase,Width,Turn.circle,Rear.seat.room,Luggage.room,Weight,Origin,Make
1,Acura,Integra,Small,12.9,15.9,18.8,25,31,None,Front,...,5,177,102,68,37,26.5,11.0,2705,non-USA,Acura Integra
2,Acura,Legend,Midsize,29.2,33.9,38.7,18,25,Driver & Passenger,Front,...,5,195,115,71,38,30.0,15.0,3560,non-USA,Acura Legend
3,Audi,90,Compact,25.9,29.1,32.3,20,26,Driver only,Front,...,5,180,102,67,37,28.0,14.0,3375,non-USA,Audi 90

In [85]:
# replace the "." with "-"
cols = list(map(lambda x: x.replace(".", "_"), df_car.columns))
df_car.columns= cols
df_car.head(3)

,Manufacturer,Model,Type,Min_Price,Price,Max_Price,MPG_city,MPG_highway,AirBags,DriveTrain,...,Passengers,Length,Wheelbase,Width,Turn_circle,Rear_seat_room,Luggage_room,Weight,Origin,Make
1,Acura,Integra,Small,12.9,15.9,18.8,25,31,None,Front,...,5,177,102,68,37,26.5,11.0,2705,non-USA,Acura Integra
2,Acura,Legend,Midsize,29.2,33.9,38.7,18,25,Driver & Passenger,Front,...,5,195,115,71,38,30.0,15.0,3560,non-USA,Acura Legend
3,Audi,90,Compact,25.9,29.1,32.3,20,26,Driver only,Front,...,5,180,102,67,37,28.0,14.0,3375,non-USA,Audi 90

In [86]:
# or, 3rd method

df_car.columns.values[2]='CarType'

In [102]:
df_car.head(3)

,Manufacturer,Model,CarType,Min_Price,Price,Max_Price,MPG_city,MPG_highway,AirBags,DriveTrain,...,Passengers,Length,Wheelbase,Width,Turn_circle,Rear_seat_room,Luggage_room,Weight,Origin,Make
1,Acura,Integra,Small,12.9,15.9,18.8,25,31,None,Front,...,5,177,102,68,37,26.5,11.0,2705,non-USA,Acura Integra
2,Acura,Legend,Midsize,29.2,33.9,38.7,18,25,Driver & Passenger,Front,...,5,195,115,71,38,30.0,15.0,3560,non-USA,Acura Legend
3,Audi,90,Compact,25.9,29.1,32.3,20,26,Driver only,Front,...,5,180,102,67,37,28.0,14.0,3375,non-USA,Audi 90

###  40. How to check if a dataframe has any missing values?

In [144]:
df_car.isnull().any()

Manufacturer          False
Model                 False
Type                  False
Min.Price             False
Price                 False
Max.Price             False
MPG.city              False
MPG.highway           False
AirBags               False
DriveTrain            False
Cylinders             False
EngineSize            False
Horsepower            False
RPM                   False
Rev.per.mile          False
Man.trans.avail       False
Fuel.tank.capacity    False
Passengers            False
Length                False
Wheelbase             False
Width                 False
Turn.circle           False
Rear.seat.room         True
Luggage.room           True
Weight                False
Origin                False
Make                  False
dtype: bool

### 41. How to count the number of missing values in each column?
#### Count the number of missing values in each column of df. Which column has the maximum number of missing values?

In [159]:
df_car.isnull().sum()

Manufacturer           0
Model                  0
Type                   0
Min.Price              0
Price                  0
Max.Price              0
MPG.city               0
MPG.highway            0
AirBags                0
DriveTrain             0
Cylinders              0
EngineSize             0
Horsepower             0
RPM                    0
Rev.per.mile           0
Man.trans.avail        0
Fuel.tank.capacity     0
Passengers             0
Length                 0
Wheelbase              0
Width                  0
Turn.circle            0
Rear.seat.room         2
Luggage.room          11
Weight                 0
Origin                 0
Make                   0
dtype: int64

In [175]:
df_car.isnull().sum().idxmax()   # to get the maximum null values in the columns[idxmax-to count maximum from series, argmax- to count maximum from dataframe]

'Luggage.room'

### 42. How to replace missing values of multiple numeric columns with the mean?
#### Replace missing values in Luggage.room columns with their respective mean.

In [167]:
mean_=df_car.mean()
mean_

Min.Price               17.125806
Price                   19.509677
Max.Price               21.898925
MPG.city                22.365591
MPG.highway             29.086022
EngineSize               2.667742
Horsepower             143.827957
RPM                   5280.645161
Rev.per.mile          2332.204301
Fuel.tank.capacity      16.664516
Passengers               5.086022
Length                 183.204301
Wheelbase              103.946237
Width                   69.376344
Turn.circle             38.956989
Rear.seat.room          27.829670
Luggage.room            13.890244
Weight                3072.903226
dtype: float64

In [191]:
df_car.fillna(mean_).head()

,Manufacturer,Model,Type,Min.Price,Price,Max.Price,MPG.city,MPG.highway,AirBags,DriveTrain,...,Passengers,Length,Wheelbase,Width,Turn.circle,Rear.seat.room,Luggage.room,Weight,Origin,Make
1,Acura,Integra,Small,12.9,15.9,18.8,25,31,None,Front,...,5,177,102,68,37,26.5,11.0,2705,non-USA,Acura Integra
2,Acura,Legend,Midsize,29.2,33.9,38.7,18,25,Driver & Passenger,Front,...,5,195,115,71,38,30.0,15.0,3560,non-USA,Acura Legend
3,Audi,90,Compact,25.9,29.1,32.3,20,26,Driver only,Front,...,5,180,102,67,37,28.0,14.0,3375,non-USA,Audi 90
4,Audi,100,Midsize,30.8,37.7,44.6,19,26,Driver & Passenger,Front,...,6,193,106,70,37,31.0,17.0,3405,non-USA,Audi 100
5,BMW,535i,Midsize,23.7,30.0,36.2,22,30,Driver only,Rear,...,4,186,109,69,39,27.0,13.0,3640,non-USA,BMW 535i

In [190]:
df5=pd.DataFrame(df_car['Luggage.room'])             # to fill specific column with mean value
df5.fillna(mean_).head(3)

   Luggage.room
1          11.0
2          15.0
3          14.0

### 43. How to use apply function on existing columns with global variables as additional arguments?
#### In df, use apply method to replace the missing values in Rear.seat.room with mean Luggage.room with median by passing an argument to the function.

###  44. How to select a specific column from a dataframe as a dataframe instead of a series?
#### Get the first column (a) in df as a dataframe (rather than as a Series).

In [200]:
df = pd.DataFrame(np.arange(20).reshape(-1, 5), columns=list('abcde'))
df

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [201]:
df['a']                  #   getting out as series

0     0
1     5
2    10
3    15
Name: a, dtype: int32

In [202]:
type(a)

pandas.core.series.Series

In [204]:
df['a'].to_frame()  # getting out as DataFrame

    a
0   0
1   5
2  10
3  15

###  45. How to change the order of columns of a dataframe?
##### Actually 3 questions.
##### 1. In df, interchange columns 'a' and 'c'.
##### 2. Create a generic function to interchange two columns, without hardcoding column names.
##### 3. Sort the columns in reverse alphabetical order, that is colume 'e' first through column 'a' last.

In [205]:
df = pd.DataFrame(np.arange(20).reshape(-1, 5), columns=list('abcde'))
df

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [207]:
# 1. In df, interchange columns 'a' and 'c'

df1= df[['c', 'b', 'a', 'd', 'e']]
df1

    c   b   a   d   e
0   2   1   0   3   4
1   7   6   5   8   9
2  12  11  10  13  14
3  17  16  15  18  19

In [226]:
# 2. Create a generic function to interchange two columns, without hardcoding column names.

In [243]:
# 3. Sort the columns in reverse alphabetical order, that is colume 'e' first through column 'a' last.

#df2=df[[::-1]]

col_list=df.columns.tolist()
col_rlist=col_list[::-1]
n_df=df[col_rlist]

In [244]:
n_df

    e   d   c   b   a
0   4   3   2   1   0
1   9   8   7   6   5
2  14  13  12  11  10
3  19  18  17  16  15

###  46. How to set the number of rows and columns displayed in the output?

#### Change the pandas display settings on printing the dataframe df it shows a maximum of 10 rows and 10 columns.